<template>
  <div>
    <v-sheet color="grey lighten-2">
      <v-container fluid class="py-4">
        <v-breadcrumbs class="py-0" :items="bh">
          <template #divider>
            <v-icon>mdi-chevron-right</v-icon>
          </template>
        </v-breadcrumbs>
      </v-container>
    </v-sheet>
    <v-container class="my-5">
      <h1 class="mb-5">{{title}}</h1>


     

<h2 class="my-5">■ 検索</h2>



<ul>
  <li>トップページの「資料を見る」を選択すると、国立国会図書館デジタルコレクションで公開されている『校異源氏物語』がページ単位で表示されます。</li>
  <li>ページを選択すると『校異源氏物語』のテキストが表示され、その下に「類似度の高い見開きページ」が表示されます。</li>
    <li>ページの選択では、左側にある「巻名」での絞り込み表示が可能です。『校異源氏物語』のテキストデータを対象にしたキーワード検索も可能です。また検索時に「巻名」を指定すると、その帖だけを対象にした検索ができます。</li>
  </ul>


  <h2 class="my-5">■ 「類似度の高い見開きページ」について</h2>

<ul>
  <li>『校異源氏物語』はテキストデータ化されていますが、「デジタル源氏物語」で公開されている各『源氏物語』のテキストデータは存在していません。同じ『源氏物語』なのでどれも一緒では？と思われるかもしれませんが、実際は異同があり、また原本の装丁によって1丁に書かれている文字数が違っているため、「『校異源氏物語』「桐壺」の10ページ目」と言っても、他の資料も同じく10ページ目にあるわけではありません。そこでまず裏源氏勉強会では、『校異源氏物語』に記されている頁番号を東大本、九大本に付与しました。</li>
  <li>この「AI画像検索」では、諸本の検索の利便性を高めるため、くずし字OCRによるデータを用いた検索結果を提供しています。各『源氏物語』をくずし字OCRにかけ、テキストデータを持たせます。それと『校異源氏物語』のテキストデータを画像コマ単位（見開きページ単位）で照合させ、類似度の高いものから表示しています。</li>
    <li>くずし字OCRの解読結果に対しては、人手による修正は加えていません。また上記のとおり本文には異同があり、ページ単位も違うため類似度が100%になることは無く、50％に満たない場合であってもそれが最も高い数値であれば、該当画像である可能性が高いと思われます。</li>
    <li>このAI画像検索は正確なテキストデータの提供ではなく、『校異源氏物語』をもとにして、テキストデータを持たない諸本の横断検索を効率よく行うためのシステムです。</li>
  </ul>

  <h2 class="my-5">■ 「いいね」ボタン</h2>

<ul>
  <li>レコメンドされたページの中で、お探しのものと一致している場合はハート型のアイコンをクリックしてください。</li>
  </ul>
      
      <h2 class="my-5">■ 利用者の皆さま</h2>

<ul>
  <li>この「AI画像検索」は「デジタル源氏物語」の新しい機能です。「類似度の高い見開きページ」の提案から求める画像を選択するプロセスを実際にお試しいただき、もし不具合やお気づきの点、あったら良いと思われる機能などがありましたら、「お問い合わせ」欄に記載されているメールアドレスまでお知らせいただければ幸いです。また、画像の符合状況は次に利用される方の参考になりますので、求める画像と一致した場合は「いいね」ボタンへの御協力もよろしくお願いいたします。</li>
  </ul>
      
      <h2 class="my-5">■ 図書館など画像公開機関の皆さま</h2>

<ul>
  <li>「デジタル源氏物語」では、『源氏物語』の画像公開機関とのデータ連携や作業協力を広くお願いしています。この「AI画像検索」でも、検索対象となる『源氏物語』画像の提供を募っています。「AI画像検索」への提供にあたっては、前準備や必要な作業をお願いすることはありません。他機関が公開する『源氏物語』との横断的な検索が可能になる場所ですので、ご関心のある方は次の条件をご確認のうえ是非一度ご連絡ください。</li>
  </ul>

  <h3 class="my-4">【AI画像検索への参加について】</h3>

  <p>
    次のどちらにも該当する場合になります。
    <ol>
  <li>IIIF（トリプルアイエフ）で画像が公開されていること</li>
  <li>画像の利用条件が次のいずれかであること：①パブリックドメインとして公開　②自由利用可能として公開</li>
  </ol>
  </p>

  <h3 class="my-4">【お問合せ先】</h3>

  <p>
    <a href="mailto:digital-genji-public@googlegroups.com">digital-genji-public@googlegroups.com</a>
  </p>

    </v-container>

    <p v-if="false">
        <ul>
          <li>「OCRテキスト」には誤読が含まれる可能性があります。ご利用の際はご注意ください。</li>
        </ul>
      </p>
  </div>
</template>

<script>
export default {
  data() {
    return {
      baseUrl: process.env.BASE_URL,
      title : this.$t("about_"),
      
    }
  },
  head() {
    const title = this.title
    return {
      title,
    }
  },
  computed: {
    bh() {
      return [
        {
          text: this.$t('top'),
          disabled: false,
          to: this.localePath({ name: 'index' }),
          exact: true,
        },
        {
          text: this.title,
        },
      ]
    }
  },
}
</script>
